# -*- coding: utf-8 -*-
def zapolnenie(answers, TOTAL_TEXT):
    answers[0][0] = "Чтобы стать волонтёром в кронотском заповеднике вам нужно, как стать волонтёром, подача заявки на трудоустройство, начать работу, как трудоустроиться"
    answers[0][1] = """Добрый день! От Вас поступил запрос о прохождении волонтерских работ на территории Кроноцкого государственного заповедника/Южно-Камчатского федерального заказника, для постановки в график Вам необходимо:

    1) Заполнить анкету на прохождение обучения в Школе Защитников Природы, ссылка на форму анкеты:
    https://docs.google.com/forms/d/1idhdo4KswngdMijyXZWx_TXGWqJuKn7ySRzjeR0UnsI/edit;

    2) Пройти курс, по окончании которого у Вас будет итоговый тест, в случае успешного результата Вас перенаправят в отдел познавательного туризма, далее Вы заполняете еще одну анкету (волонтера Кроноцкого заповедника) по утвержденной форме на сайте www.kronoki.ru, в разделе ВОЛОНТЕРСТВО,
    в левом меню выбираем пункт ОФОРМИТЬ ЗАЯВКУ, либо по ссылке, ссылка на форму анкеты: https://docs.google.com/forms/d/e/1FAIpQLSe1gyTpb69_1pNQPa3bFChFebvAfFMMDyBSWL9cUeRJqLSBWQ/viewform;

    Прием заявок на 2022 год начинается с 05.12.2021 года
    Обращаем внимание, что, заполняя форму, вы даете согласие на обработку персональных данных
    в соответствии с «Пользовательским соглашением» и «Политикой конфиденциальности».
    Регистрация на сайте «Добровольцы России»- обязательна, ссылка на сайт: https://dobro.ru/.
    Заявок всегда в десятки раз больше, чем мест. Мы тщательно отбираем волонтеров, учитываем их образование,
    профессию, наличие рекомендаций от других заповедников и личные качества.Дистанционно выбрать
    подходящего человека бывает сложно,
    поэтому мы рады, когда вы сопровождаете заявки короткими видео о себе (на 1-2 минуты).
    Вам необходимо предоставить рекомендации, благодарности по итогам участия в волонтерских акциях и
    проектах (при наличии).
    Приветствуется наличие личной книжки волонтёра.

    При наличии, просьба предоставить справки о прохождении медицинской комиссии, если проходили в течение последнего года,
    или предоставить расписку о состоянии здоровья (ограничения, хронические заболевания)
    Предоставить туристическую страховку."""
    answers[1][0] = "Что делать, если тебя, твою анкету одобрили, приняли на работу, рекомендован"
    answers[1][
        1] = """Договор о добровольческой деятельности для ознакомления. Внимательно изучив все пункты договора и его приложений, Вы высылаете нам скан-копию подписанного документа."""
    answers[2][
        0] = "Если человека интересует срок, длительность, продолжительность работы, когда она заканчивается, до скольки нужно работать, рабочий срок когда кончается"
    answers[2][1] = """Мы ставим Вас в график волонтерских работ на сезон согласно срокам, указанным в договоре. Минимальный срок работы на охраняемых территориях-3 недели.
                       По мере формирования, график на текущий сезон размещается на сайте www.kronoki.ru в разделе ВОЛОНТЕРСТВО НА ТЕРРИТОРИЯХ."""
    answers[3][
        0] = "Какой ивентарь находится в собственности заповедника, рабочие инструменты, что нужно взять, собрать вещи, снаряжениею. Что из личных вещей, обувь, одежда, можно ли приносить свои личные вещи, собственность"
    answers[3][1] = """Потребуется стандартное походное снаряжение, за исключением палатки и посуды для приготовления еды на костре:
                       высокие резиновые сапоги («болотники»), спальник, коврик, налобный фонарик, термос, личная посуда
                       (на некоторых кордонах вся посуда есть), биоразлагаемые средства гигиены, репелленты.
                       Погода на Камчатке быстро и часто меняется – не забудьте про теплую и водоотталкивающую одежду и обувь.
                       В теплые дни из соображений этики нельзя ходить по кордону в купальнике и коротких шортах,
                       поэтому комплект легкой одежды тоже возьмите с собой. Помните, вы – лицо заповедника, наравне с сотрудниками!"""
    answers[4][
        0] = "Инфраструктура кордонов, транспортные пути, стирка, уборка, место проживания, расположение домов, туалеты, средства гигиены, естесственные потребности"
    answers[4][1] = """	
    Волонтёры, работающие на кордонах, размещаются в домиках или модулях (сборные сезонные конструкции),
    спят в спальниках, либо на раскладушках с постельным бельём. Туалеты расположены вне домиков. Есть баня и\или душ,
    возможность стирать и сушить личные вещи. Волонтёры, участвующие в работах по прочистке троп, иногда ночуют в
    палатках или в инспекторских домах на полевых стационарах (условия минимальные)."""
    answers[5][
        0] = "Есть ли связь и интернет, как можно воспользоваться сетевыми услугами, звонить. Есть ли электричество?"
    answers[5][1] = """	
    На всех кордонах есть электрогенераторы и солнечные батареи, то есть, возможность заряжать гаджеты у вас будет.
    Сотовой связи нет нигде. На многих кордонах утром и вечером есть интернет (очень медленный, но весточку родным
    отправить возможно)."""
    answers[6][
        0] = "Какие требования о прививках, справках, документах,требуются ли для трудоустройства медицинские показания, какие медицинские осмотры нужно пройти"
    answers[6][1] = """Заповедные территории – зоны высокой вулканической и сейсмической активности, вокруг множество диких животных,
    а штатных врачей на кордонах нет. Поэтому мы приветствуем медицинские справки, а также просим вас самостоятельно
    оформить страхование жизни и здоровья, также необходимо иметь при себе отрицательный ПЦР тест на Covid-19.
    Не забудьте взять личную аптечку!"""
    answers[7][
        0] = "Дает, предоставляет ли заповедник продукты питания, еду или же требуется закупать еду, пропитание самому"
    answers[7][1] = """	
    Основные продукты питания предоставляютя волонтеру. Заповедник обеспечивает пайком каждого волонтера.
    Вам необходимо будет только докупить для себя фрукты,овощи, кондитерские изделия, молочные продукты
    по своему вкусовому предпочтению"""
    answers[8][
        0] = "Что я должен иметь с собой при приёме на работу? Заключение договора, где происходит, куда приезжать, что нужно иметь при себе для оформления на работу."
    answers[8][1] = """
    Ознакомление, подписание всех необходимых документов (договор о добровольческой деятельности в 2-х экземплярах,
    правила пожарной безопасности,инструкция при встрече с бурым медведем, правила санитарной безопасности в лесах,
    соглашение о соблюдении волонтером информационной политики Кроноцкого заповедника в области соц.сетей, ведомость
    о списании продуктов), выдача разрешений на посещение ООПТ проходит в офисе учреждения, по адресу: город Елизово,
    ул.Рябикова, дом 48. При себе необходимо иметь паспорт.
    Вам также выдается фирменная футболка волонтера, бандана.
    ВАЖНО! Все документы должны быть подписаны до отправки на кордон. Если у Вас по тем или иным причинам не
    получается сделать это до начала волонтерских работ, то Вам необходимо заранее сообщить нам об этом, заключить
    договор дистанционно, ознакомиться с правилами, и отправить цветные скан-копии документов. И после окончания работ
    обязательно подписать оригиналы документов в учреждении."""
    answers[9][
        0] = "Где остановится перед отправкой на сами кордоны, до пребывания на территорию заповедника. Сколько стоит остановка, временное жильё?"
    answers[9][1] = """
    Так как добровольцев отправляют бесплатно на туристических или технических бортах, не в каждом вертолете есть
    свободное место. Пожалуйста, учитывайте это при планировании длительности пребывания на Камчатке и бюджета на
    размещение в г. Елизово или в г. Петропавловск-Камчатский. Мы можем предложить вам содействие в размещении в одном
    из хостелов Петропавловска-Камчатского и Елизово даже в самый высокий туристический сезон."""
    answers[10][0] = "Выходные, отпуск, отгул, когда отпуск предоставляющиеся для волонтёров"
    answers[10][1] = """
    Доброволец обязан выполнять работы, оговоренные в соглашении. При нарушении условий договора ФГБУ
    «Кроноцкий государственный заповедник» в одностороннем порядке расторгает договор, и доброволец самостоятельно
    организует и оплачивает своё возвращение с территории.
    * Руководитель кордона старается распределить нагрузку на волонтеров таким образом, чтобы у каждого была возможность
    побывать на экскурсиях."""
    answers[11][0] = "Окончания работ нужно ли посещать офис, писать отзыв, отчёт, личная книжка волонтёров."
    answers[11][1] = """	
    По возвращении с территорий волонтеру необходимо написать отзыв и отчет добровольца (приложение №4,№5 к договору).
    Выдается личная волонтерская книжка(при отсутствии),с отметкой о дате и сведениях о деятельности волонтера."""
    answers[12][0] = "Какая дата вылета, когда отправляться?"
    answers[12][1] = """
    В зависимости от места нахождения для добровольцев есть три варианта отправки на кордоны: вертолет, вахтовка или
    маломерное судно. Например, добраться в Долину гейзеров, или в кальдеру вулкана Узон можно только на вертолете.
    На кордон Семячик или Кроноки – на маломерном судне или вертолете, на кордоны Травяной или Озерный можно
    добраться как на вахтовке, так и на вертолете. Если погода позволяет, то трудностей в отправке не возникнет.
    Однако, время ожидания отправки может составить от двух суток до двух недель."""
    for i in range(13):
        TOTAL_TEXT += answers[i][0] + '\n'
    return answers, TOTAL_TEXT